/*
 * Напиши скрипт выбора стоимости отеля по кол-ву звёзд.
 * 1 - 20$, 2 - 30$, 3 - 50$, 4 - 70$, 5 - 120$
 *
 * Если в переменной stars что-то кроме чисел 1-5, выведи строку
 * 'Такого кол-ва звезд нет'
 */

// const stars = 4;
// let price;

// if (stars === 1) {
//     price = 20;
// } else if (stars === 2) {
//     price = 30;
// } else if (stars === 3) {
//     price = 50;
// } else if (stars === 4) {
//     price = 70;
// } else if (stars === 5) {
//     price = 120;
// } else {
//     console.log('Такго кол-ва звезд нет');
// }

// console.log(price);

/* Напиши скрипт который выводит игрока Sergio Ramos за 
определенную сумму в разную команду, использу инструкцию swithc
*/ 

// const player = 'Sergio Ramos';
// let price = Number(prompt('Введите сумму'));
// let team;

// switch (price) {
//     case 100:
//         team = 'Chelsea';
//         break;

//     case 200:
//         team = 'Barcelona';
//         break;
    
//     case 300:
//         team = 'PSG';
//         break; 
    
//     default:
//         console.log(`${player} остается в своей команде!`);
// }

// console.log(`Игрок ${player} был куплен в команду ${team}!`);

/* ---------------------------------------------------------------------
 * Напиши скрипт выбора опции доставки товара.
 * Опция хранится в переменной option: 1 - самовывоз, 2 - курьер, 3 - почта
 *
 * В переменную message записать сообщение в зависимости от опции.
 * - 'Вы сможете забрать товар завтра с 12:00 в нашем офисе'
 * - 'Курьер доставит заказ завтра с 9:00 до 18:00'
 * - 'Посылка будет отправлена сегодня'
 * - 'Вам перезвонит менеджер'
 */


// 1) создать вары
// const option = 1;
// let message;

// 2) создать инструкцию
// switch (option) {
//     case 1:
//         message = 'Вы сможете забрать товар завтра с 12:00 в нашем офисе';
//         break;
//     case 2:
//         message = 'Курьер доставит заказ завтра с 9:00 до 18:00';
//         break;
//     case 3:
//         message = 'Посылка будет отправлена сегодня';
//         break;
//     default:
//         message = 'Вам перезвонит менеджер';        
// }

// console.log(message);

