/*
В имени исп определенные префиксы, обозначающие действие,
после которых следует обьект действия.

Ф начинающиеся с
"show..." - что то показывают,
"get..." - возвращают значение,
"calc..." - что то вычысляет,
"create..." - что то создают,
"check..." - что то проверяют и возвращают лог значение

Примеры:
showMessage - показать сообщение
getOptions - получить параметры
calcSum - посчитать сумму
*/

/*
Функция должна делать только то,
что явно подразумевается её названием.
И это должно быть одним действием.
Два независимых действия обычно подразумевают две функции,
даже если предполагается, что они будут вызываться вместе (в этом случае мы
можем создать третью функцию, которая будет их вызывать).
*/



